In [1]:
# Import the required libraries and dependencies
import pandas as pd
from pathlib import Path
from sqlalchemy import inspect, create_engine
connection_string = 'sqlite:///./src/data/stw_data.db'
engine = create_engine(connection_string)
insp = inspect(engine)

In [3]:

# def init_data():
#     cities_df = pd.read_csv(Path("./src/data/cities.csv"))
#     donations_df = pd.read_csv(Path("./src/data/donations_ho.csv"))
#     organizations_df = pd.read_csv(Path("./src/data/organizations_ho.csv"))
#     # recipients_df = pd.read_csv(Path("./src/data/recipients.csv"))
#     cities_df.to_sql('CITIES', engine, index=False, if_exists='replace')
#     donations_df.to_sql('DONATIONS', engine, index=False, if_exists='replace')
#     organizations_df.to_sql('ORGANIZATIONS', engine, index=False, if_exists='replace')
#     # recipients_df.to_sql('RECIPIENTS', engine, index=False, if_exists='replace')

# def get_data(query):
#     df = pd.read_sql_query(query, con=engine)
#     return df

engine.table_names()

Engine(sqlite:///)

In [6]:
# Write a SQL query to insert a new entry into the credit_score_info table. 
# The information for the new entry is as follows:
# 'names': 'Martha Johnson'; 'cities': 'Lockport'; 'credit_score': 776; 'credit_score_provider';'TransUnion'

insert_data="""
INSERT INTO credit_score_info('names', 'cities', 'credit_score', 'credit_score_provider') 
VALUES ('Martha Johnson', 'Lockport', 776, 'TransUnion')
"""

In [7]:
# Call on the database engine to insert the new information into the table
engine.execute(insert_data)

# Read the adjusted database table into the sql_credit_score_info_df DataFrame
sql_credit_score_info_df = pd.read_sql_table('credit_score_info', con=engine)

# Confirm the table has been updated by reviewing the last five rows of the DataFrame 
display(sql_credit_score_info_df.tail())

                names           cities  credit_score credit_score_provider
96      Stacy Johnson         Garzaton           596               Equifax
97       Amanda Baker         Vegatown           368               Equifax
98     Dawn Underwood   New Brianshire           830              Experian
99   Kelly Valenzuela  Castillochester           368              Experian
100    Martha Johnson         Lockport           776            TransUnion

In [8]:
# # Write the SQL query to review all columns in the credit_score_info table
# # for the clients whose credit_score is greater than or equal to 750
# query_750_plus="""
# SELECT *
# FROM credit_score_info
# WHERE credit_score >= 750
# """

# # Call on the database engine to execute the query that generates the list
# # of clients whose credit scores are greater than or equal to 750
# results = engine.execute(query_750_plus)

# # List of the results of the database query
# list(results)

[('Paul Hall', 'Bethshire', 794, 'Experian'),
 ('Shane Andersen', 'Brownview', 759, 'Experian'),
 ('Christy Wagner', 'Ritafort', 805, 'TransUnion'),
 ('Taylor Turner', 'Rachelfort', 759, 'Experian'),
 ('Cynthia Strong', 'Emilymouth', 770, 'TransUnion'),
 ('Rebecca Cook', 'North Lynnbury', 819, 'Equifax'),
 ('Felicia Vargas', 'New Carol', 768, 'Experian'),
 ('Morgan Bradshaw', 'Huynhfort', 792, 'Equifax'),
 ('Stacy Keller', 'Lauraborough', 791, 'Equifax'),
 ('Tracey Smith', 'Janetview', 815, 'TransUnion'),
 ('Tara Wright', 'Hatfieldville', 762, 'Equifax'),
 ('Jacob Pineda', 'North Victoriaside', 842, 'Experian'),
 ('Dawn Underwood', 'New Brianshire', 830, 'Experian'),
 ('Martha Johnson', 'Lockport', 776, 'TransUnion')]

In [9]:
# Write the query to Update Stacy Keller's credit score to 810
update_score = """
UPDATE credit_score_info
SET credit_score = 810
WHERE names = 'Stacy Keller'
"""

# Execute the update in the database
engine.execute(update_score)

# Rerun the query that generates the list of clients whose 
# credit scores are greater than or equal to 750 
# to confirm that Stacy's score was updated appropriately
results = engine.execute(query_750_plus)

# List of the results of the database query
list(results)

[('Paul Hall', 'Bethshire', 794, 'Experian'),
 ('Shane Andersen', 'Brownview', 759, 'Experian'),
 ('Christy Wagner', 'Ritafort', 805, 'TransUnion'),
 ('Taylor Turner', 'Rachelfort', 759, 'Experian'),
 ('Cynthia Strong', 'Emilymouth', 770, 'TransUnion'),
 ('Rebecca Cook', 'North Lynnbury', 819, 'Equifax'),
 ('Felicia Vargas', 'New Carol', 768, 'Experian'),
 ('Morgan Bradshaw', 'Huynhfort', 792, 'Equifax'),
 ('Stacy Keller', 'Lauraborough', 810, 'Equifax'),
 ('Tracey Smith', 'Janetview', 815, 'TransUnion'),
 ('Tara Wright', 'Hatfieldville', 762, 'Equifax'),
 ('Jacob Pineda', 'North Victoriaside', 842, 'Experian'),
 ('Dawn Underwood', 'New Brianshire', 830, 'Experian'),
 ('Martha Johnson', 'Lockport', 776, 'TransUnion')]

In [10]:
# Write the query to remove Taylor Turner from the credit_score_info table
delete_client = """
DELETE FROM credit_score_info
WHERE names = 'Taylor Turner'
"""

# Execute the deletion of the client in the database
engine.execute(delete_client)

# Rerun the query that generates the list of clients whose 
# credit scores are greater than or equal to 750 
# to confirm that Taylor was deleted from the list
results = engine.execute(query_750_plus)

# List of the results of the database query
list(results)

[('Paul Hall', 'Bethshire', 794, 'Experian'),
 ('Shane Andersen', 'Brownview', 759, 'Experian'),
 ('Christy Wagner', 'Ritafort', 805, 'TransUnion'),
 ('Cynthia Strong', 'Emilymouth', 770, 'TransUnion'),
 ('Rebecca Cook', 'North Lynnbury', 819, 'Equifax'),
 ('Felicia Vargas', 'New Carol', 768, 'Experian'),
 ('Morgan Bradshaw', 'Huynhfort', 792, 'Equifax'),
 ('Stacy Keller', 'Lauraborough', 810, 'Equifax'),
 ('Tracey Smith', 'Janetview', 815, 'TransUnion'),
 ('Tara Wright', 'Hatfieldville', 762, 'Equifax'),
 ('Jacob Pineda', 'North Victoriaside', 842, 'Experian'),
 ('Dawn Underwood', 'New Brianshire', 830, 'Experian'),
 ('Martha Johnson', 'Lockport', 776, 'TransUnion')]

In [11]:
# Write the SQL query to review all columns in the credit_score_info table
# for the clients whose credit_score is greater than or equal to 790
query_790_plus="""
SELECT *
FROM credit_score_info
WHERE credit_score >= 790
"""

# Call on the database engine to execute the query that generates the list
# of clients whose credit scores are greater than or equal to 790
results = engine.execute(query_790_plus)

# Create a DataFrame from the results list
sql_credit_score_over_790_df = pd.DataFrame(results)

# Review the DataFrame
sql_credit_score_over_790_df

                 0                   1    2           3
0        Paul Hall           Bethshire  794    Experian
1   Christy Wagner            Ritafort  805  TransUnion
2     Rebecca Cook      North Lynnbury  819     Equifax
3  Morgan Bradshaw           Huynhfort  792     Equifax
4     Stacy Keller        Lauraborough  810     Equifax
5     Tracey Smith           Janetview  815  TransUnion
6     Jacob Pineda  North Victoriaside  842    Experian
7   Dawn Underwood      New Brianshire  830    Experian

In [13]:
# Write the sql_credit_score_over_790_df DataFrame to a new table in the database
# Be sure include the parameters for the engine, the index and if_exists with the function
# The new table should be called sql_credit_score_over_790
sql_credit_score_over_790_df.to_sql(
    'sql_credit_score_over_790', 
    engine, 
    index=False, 
    if_exists='replace'
)

# Confirm that the table was created by calling the table_names function on 
# the database engine
engine.table_names()

C:\Users\hoestreicher\anaconda3\envs\dev\lib\site-packages\ipykernel_launcher.py:13: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  del sys.path[0]

['credit_score_info', 'sql_credit_score_over_790']

In [14]:
# Read in the sql_credit_score_over_790 table from the database
pd.read_sql_table('sql_credit_score_over_790', con=engine)

              Name                City  Credit Score Credit Score Provider
0        Paul Hall           Bethshire           794              Experian
1   Christy Wagner            Ritafort           805            TransUnion
2     Rebecca Cook      North Lynnbury           819               Equifax
3  Morgan Bradshaw           Huynhfort           792               Equifax
4     Stacy Keller        Lauraborough           810               Equifax
5     Tracey Smith           Janetview           815            TransUnion
6     Jacob Pineda  North Victoriaside           842              Experian
7   Dawn Underwood      New Brianshire           830              Experian